Rails/app/controllers/players_controller.rb

SELECT "players".* FROM "players"
---
  def index
    players = Player.all

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    player = Player.find(params[:id])