Rails/app/controllers/tournaments_controller.rb

SELECT "tournaments".* FROM "tournaments"
---
  def index
    tournaments = Tournament.all

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    tournament = Tournament.find(params[:id])